luisi-at/nrf52_experiments/gps_rtt_logging/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
/*
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

void send_gps_msg(uint8_t * msg_string, uint16_t length)
{
  
  
  for(uint32_t i = 0; i < length; i++)
  {
     while (app_uart_put(msg_string[i]) != NRF_SUCCESS);
  }

}


/**@brief Application main function.
 */
void handle_gps(uint8_t * p_data, uint8_t length)
{
  
    // Do something with the string
    char * received_command = (char*)p_data;
    //NRF_LOG_INFO("Data Received!");

    // dump out the RX
    //send_gps_msg(p_data, length);
    //printf(received_command);

    /*
   if(received_command[0] == '$')
    {

      //NRF_LOG_INFO("%s", nrf_log_push(received_command));

    }
    */

}

void uart_error_handle(app_uart_evt_t * p_event)
{
    
    uint32_t err_code;
    static uint16_t index = 0u;
    static uint8_t data[UART_RX_BUF_SIZE];


    switch(p_event->evt_type)
    {
      case APP_UART_DATA_READY:
        // recover the string
        UNUSED_VARIABLE(app_uart_get(&data[index]));
        index++;
        nrf_gpio_pin_toggle(LED_4); // toggle LED 4 to see if the interrupt is still ocurring
        nrf_gpio_pin_toggle(TEST_PIN); // toggle Arduino pin 7 for the scope/analyzer

        if((data[index-1] == '\n') || (index >= UART_RX_BUF_SIZE))
        {
          // Handle the GPS string
          handle_gps(data, index);
          index = 0;
          
        }

        break;

      case APP_UART_COMMUNICATION_ERROR:
        APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

      case APP_UART_FIFO_ERROR:
        APP_ERROR_HANDLER(p_event->data.error_code);
        break;

      default:
        break;
    }
    
}


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t err_code;

    const app_uart_comm_params_t comm_params =
    {
          ARDUINO_1_PIN,
          ARDUINO_0_PIN,
          NULL,
          NULL,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,
          NRF_UART_BAUDRATE_9600

    };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);

}

/**
 * @brief Function for main application entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
    uint8_t set_required_settings;

    bsp_board_init(BSP_INIT_LEDS);

    // ARDUINO_1_PIN RX_PIN_NUMBER
    // ARDUINO_0_PIN TX_PIN_NUMBER

    //NRF_LOG_DEFAULT_BACKENDS_INIT();
    //ret_code_t ret_code = nrf_pwr_mgmt_init();
    //APP_ERROR_CHECK(ret_code);

    // Serial Comms
    uart_init();
    //log_init();

    nrf_gpio_cfg_output(LED_4); // 
    nrf_gpio_cfg_output(TEST_PIN); // Arduino pin 7
    //nrf_gpio_cfg_output(ARDUINO_A0_PIN);

    char command[] = "$PMTK104*37\r\n";
    uint8_t length = strlen(command); //sizeof(command)/sizeof(char);
    uint8_t * msg = (uint8_t *)(command);
    send_gps_msg(msg, length);

    nrf_delay_ms(200u);

    strcpy(command, "$PMTK301,1*2D\r\n");
    length = strlen(command);
    msg = (uint8_t *)(command);
    send_gps_msg(msg, length);

    nrf_delay_ms(200u);

    strcpy(command, "$PMTK250,1,1,9600*16\r\n");
    length = strlen(command);
    msg = (uint8_t *)(command);
    send_gps_msg(msg, length);

    nrf_delay_ms(200u);

    strcpy(command, "$PMTK458*3B\r\n");
    length = strlen(command);
    msg = (uint8_t *)(command);
    send_gps_msg(msg, length);

    // Set the Preheat high on the MiCS-4514 
    //nrf_gpio_pin_clear(ARDUINO_A0_PIN);

    //NRF_LOG_INFO("Check- Logging started on RTT.");
    //NRF_LOG_INFO("SAADC HAL simple example started.");

    while(true)
    {

      // wait to receive data

    }

}


/**
 * @}
 */
